{
  "backend/main.mo": "Motoko actor that composes blob storage functionality via a MixinStorage mixin import.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their associated files, components, test IDs, and confidence levels for sound toggle redesign, premium access codes, and unit selector additions.",
  "frontend-file-summaries.txt": "JSON map of frontend source files to short summaries describing each file's purpose and recent changes across the project.",
  "frontend/index.css": "Tailwind CSS entry file defining CSS custom property tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the Smart Shop Ledger app, mounting the React root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root app component managing splash screen, registration modal, and page routing across six pages including a product-list sub-page rendered outside the main Layout.",
  "frontend/src/components/DeveloperInfoModal.tsx": "Modal dialog displaying developer contact info (email and Facebook), a bilingual app description, and a styled Facebook link button.",
  "frontend/src/components/ErrorBoundary.tsx": "React class-based error boundary that catches runtime errors, logs them to the console, and renders a bilingual error UI with a reload button.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing a fixed bottom navigation bar with five tabs (Home, Add Sale, History, Profile, Settings) using translated labels.",
  "frontend/src/components/PremiumModal.tsx": "A dialog modal that accepts a promo code to unlock premium features, validating against a hardcoded list of valid codes and persisting the unlock state to localStorage.",
  "frontend/src/components/RegistrationModal.tsx": "A dialog modal form for collecting shop profile information (name, owner, mobile, address, type, photo) and saving it to localStorage, with an option to skip.",
  "frontend/src/components/SplashScreen.tsx": "A full-screen animated splash screen displaying the app logo, name, tagline, and a loading bar, which auto-dismisses after 2.5 seconds.",
  "frontend/src/components/TimerDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/TimerModal.tsx": "Empty file with no content.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider that manages the app's language state (English or Bengali), persists it to localStorage, and exposes a translation helper function `t`.",
  "frontend/src/contexts/ThemeContext.tsx": "React context provider that manages light/dark theme and theme color (red, green, black), applies them to the DOM via CSS variables, and persists selections to localStorage.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useClickSound.ts": "Custom hook that manages click sound playback using the Web Audio API or a custom audio file stored in localStorage, with controls for enabling/disabling sound and setting a custom sound.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an InternetIdentityProvider component that persists identity across page reloads.",
  "frontend/src/hooks/useTimerNotification.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind base/components/utilities and defines CSS custom properties for a red-themed (Bangladesh flag) light and dark color scheme, plus custom animations (fade-in, scale-in, shake).",
  "frontend/src/locales/translations.ts": "Exports a translations object containing English (and likely Bengali) UI strings for all app pages including navigation, registration, home, add-sale, history, profile, settings, and product list.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the root DOM element.",
  "frontend/src/pages/AddSale.tsx": "Page component for recording a new sale transaction with fields for item name, prices, quantity with unit selector, stock color indicator, and photo capture via camera or gallery upload.",
  "frontend/src/pages/History.tsx": "Page component that loads and displays past sales records from localStorage, supporting search by item name and date filtering, with delete functionality for individual records.",
  "frontend/src/pages/Home.tsx": "Dashboard home page showing today's profit and sales count (calculated from localStorage), with quick-action cards for navigating to Add Sale, History, and a premium-locked Product List feature.",
  "frontend/src/pages/ProductList.tsx": "A product management page that allows users to add, edit, delete, and expand product entries stored in localStorage, including fields for name, price, quantity with unit selector (gram/kg/liter/piece), date, and features.",
  "frontend/src/pages/Profile.tsx": "A shop profile page where users can view and edit shop details (name, owner, mobile, address, type, photo) with data persisted to localStorage.",
  "frontend/src/pages/Settings.tsx": "An app settings page providing controls for theme (light/dark, color), language (English/Bengali), sound toggle with custom sound upload, premium unlock via code or promo dialog, and developer info modal.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based semantic color tokens, custom border radii, box shadows, and keyframe animations (accordion, fade-in, scale-in, shake), plus typography, container-queries, and animate plugins.",
  "project_state.json": "A project state manifest tracking the current version, feature history, known issues, and architectural notes for a bilingual (Bengali/English) product/shopping app with premium access, sound settings, and quantity unit selectors."
}