{
  "backend/main.mo": "Motoko actor that mixes in blob storage and manages premium activations, storing activation timestamps per user and exposing functions to activate premium and query its status with a 1-year expiry.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their relevant source files, component dependencies, and test IDs for build verification.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key behaviors of every component, page, hook, and context in the project.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML shell for the React app, loading the app logo, Hind Siliguri font, AdSense SDK, and mounting the root div with the main.tsx module entry point.",
  "frontend/src/App.tsx": "Root app component orchestrating the splash → registration → interstitial → main layout flow, handling page navigation via state and custom window events, and attaching a global click-sound listener.",
  "frontend/src/components/AdBanner.tsx": "Simple ad banner component that renders a dismissible advertisement strip for non-premium users, hiding itself when the user is premium or has clicked the close button.",
  "frontend/src/components/AdMobBanner.tsx": "Google AdSense/AdMob banner component that initializes the adsbygoogle push once and renders an ins ad unit, hidden entirely for premium users.",
  "frontend/src/components/BottomSheet.tsx": "Reusable bottom sheet modal with a slide-up animation, backdrop, optional title header, and sound effects on open and close.",
  "frontend/src/components/CameraModal.tsx": "A modal component that activates the device camera using the `useCamera` hook, displays a live video preview, and captures a photo as a File on user request.",
  "frontend/src/components/CongratulationsAnimation.tsx": "Displays a full-screen confetti canvas animation with a Bengali congratulations message when a user activates premium, auto-dismissing after 3.5 seconds.",
  "frontend/src/components/DeveloperInfoModal.tsx": "A modal dialog that shows developer (MD JAHID HASAN RUBEL) and app (Smart Shop Ledger v1.0.0) information with dark/light theme support.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches render errors, logs them, and displays a bilingual (English/Bengali) fallback UI with a reload button.",
  "frontend/src/components/InterstitialAdScreen.tsx": "A full-screen interstitial ad screen with a 5-second countdown before allowing dismissal; premium users see a brief loading screen and are auto-redirected.",
  "frontend/src/components/Layout.tsx": "The main app shell providing a sticky header, scrollable main content area, a bottom navigation bar with five tabs, and a conditional ad banner for non-premium users.",
  "frontend/src/components/NotificationToast.tsx": "A fixed-position toast notification component that animates in/out from the top of the screen and auto-dismisses after 3 seconds, styled with a green shop-ledger branding theme.",
  "frontend/src/components/PremiumModal.tsx": "A bottom-sheet modal for activating premium features via promo or purchase codes, with a 1-minute trial option, email contact support, and a congratulations animation on success.",
  "frontend/src/components/RegistrationModal.tsx": "A full-screen registration modal that collects shop profile info (name, owner, phone, address, category), validates inputs, saves to localStorage, and supports skipping—both paths mark registration as complete.",
  "frontend/src/components/ShoppingListPopup.tsx": "A bottom-sheet shopping list manager that supports adding items with name/quantity/price, swipe-to-mark-bought gestures, delete, and persists data to localStorage.",
  "frontend/src/components/SplashScreen.tsx": "An animated splash screen with a progress bar that runs for ~2.5 seconds before fading out and calling an onComplete callback, featuring a green shop-ledger logo and pulsing background effects.",
  "frontend/src/components/TaskListPopup.tsx": "A bottom-sheet popup for managing a task list with add, delete, and hold-to-complete functionality, persisting tasks to localStorage and playing a bell sound on completion.",
  "frontend/src/components/TimerDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/TimerModal.tsx": "Empty file with no content.",
  "frontend/src/components/TodaysSalesPopup.tsx": "A bottom-sheet popup that reads today's sales from localStorage and displays a summary of total income, net profit, and an itemized sales list.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for English/Bengali language switching, with a translation helper `t()` that resolves dot-notated keys against a translations object, persisting the selection to localStorage.",
  "frontend/src/contexts/NotificationContext.tsx": "Provides a React context that exposes a `showNotification` function, rendering a `NotificationToast` component driven by the `useNotification` hook.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides a React context for light/dark mode and accent color theming, applying CSS custom properties to the document root when the theme changes.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useClickSound.ts": "Provides click sound playback via the Web Audio API, supporting a built-in tone or a custom base64-encoded sound from localStorage, with a `useClickSound` hook for toggling, uploading, and removing sounds.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useNotification.ts": "Custom hook that manages in-app notification visibility and message state, respecting a localStorage toggle and playing a sound on show.",
  "frontend/src/hooks/useNotificationSound.ts": "Custom hook that plays a notification sound using either a user-uploaded audio file or a default Web Audio API chime, gated by a localStorage sound-enabled flag.",
  "frontend/src/hooks/usePremiumStatus.ts": "Custom hook that reads premium activation state from localStorage, enforces a one-year expiry, and returns activation/expiry dates along with an active status flag.",
  "frontend/src/hooks/useTimerNotification.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind directives, CSS custom properties for the dark theme, typography, scrollbar styling, and keyframe animations used throughout the app.",
  "frontend/src/locales/translations.ts": "Exports a translations object containing English and Bengali string keys for all UI text used across the application.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AddSale.tsx": "Page component for recording a new sale, with a form for product name, quantity, unit, prices, color tag, note, and photo capture, saving entries to localStorage with a free-tier limit of 199 sales.",
  "frontend/src/pages/History.tsx": "Page component that displays, searches, and filters sales history from localStorage, shows today's income and profit summaries, and allows individual sale deletion.",
  "frontend/src/pages/Home.tsx": "Home dashboard page that displays today's sales stats (profit, income, items sold) loaded from localStorage, with quick-access buttons for shopping list, task list, and today's sales popups.",
  "frontend/src/pages/Lists.tsx": "A to-do/shopping list page where users can add, toggle, and delete list items with optional price and notes; adding items is premium-gated beyond free usage.",
  "frontend/src/pages/ProductList.tsx": "Product inventory management page allowing users to add, edit, and delete products with retail/wholesale prices and stock info; free users are limited to 10 products.",
  "frontend/src/pages/Profile.tsx": "Shop profile page where users can view and edit their shop name, owner name, phone, address, category, and profile photo, with data persisted to localStorage.",
  "frontend/src/pages/Settings.tsx": "Settings page providing controls for language, dark/light theme, accent color, sound, notifications, and premium subscription management with a developer info modal.",
  "frontend/src/utils/sounds.ts": "Web Audio API utility module that provides functions for generating various UI sounds (click, bell, cash register, bubble pop, whoosh) using oscillators and noise buffers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom CSS-variable-based color palette, extended border radius, custom keyframe animations (accordion, shake, slide-up, bubble-float), and plugins for animate, typography, and container queries.",
  "project_state.json": "Project state document (version 3) tracking the Smart Shop Ledger app's implemented features, architectural notes, known issues, and image requirements, including premium codes, toast notifications, ad banners, language-aware UI, and splash screen redesign."
}