{
  "backend/main.mo": "Motoko actor that mixes in blob storage and manages premium user activations, storing activation timestamps and computing 1-year expiry status via `activatePremium` and `getPremiumStatus`.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (AdMob banner integration, Facebook link update, sales history summary redesign, bottom sheet popups) to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document providing short one-sentence summaries of each frontend source file, serving as a reference index for the project's component and page structure.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, card, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point loading the AdMob/AdSense SDK, Hind Siliguri Google Font, app icons, and the React app's main.tsx module.",
  "frontend/src/App.tsx": "Root app component orchestrating the splash → registration → interstitial → main layout flow, handling page navigation via state and a custom `navigate` window event, and attaching a global click-sound listener.",
  "frontend/src/components/AdBanner.tsx": "Simple dismissible ad banner component that renders a placeholder advertisement strip and hides itself for premium users or when dismissed.",
  "frontend/src/components/AdMobBanner.tsx": "AdMob banner ad component using the AdSense `ins.adsbygoogle` tag with the configured ad client and slot, rendered only for non-premium users and initialized once via a ref guard.",
  "frontend/src/components/BottomSheet.tsx": "Reusable bottom sheet modal component that slides up to 80% screen height, plays whoosh/soft-click sounds on open/close, and renders a backdrop, drag handle, optional title header, and scrollable content area.",
  "frontend/src/components/CameraModal.tsx": "A modal component that opens the device camera using the `useCamera` hook, displays a live video preview, and captures a photo as a File object passed back via `onCapture`.",
  "frontend/src/components/CongratulationsAnimation.tsx": "Displays a full-screen confetti canvas animation with a Bengali congratulations message when premium is activated, auto-dismissing after 3.5 seconds and playing a bell sound on mount.",
  "frontend/src/components/DeveloperInfoModal.tsx": "A modal dialog showing developer (MD JAHID HASAN RUBEL) and app metadata (Smart Shop Ledger v1.0.0), styled for both dark and light themes with scrollable content.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches render errors, logs them to the console, and displays a bilingual (English/Bengali) fallback UI with a reload button.",
  "frontend/src/components/InterstitialAdScreen.tsx": "A full-screen interstitial ad overlay with a 5-second countdown before the close button appears; premium users see a brief loading screen and are auto-dismissed after 1.5 seconds.",
  "frontend/src/components/Layout.tsx": "The main app shell providing a sticky header, scrollable main content area, a fixed bottom navigation bar with five tabs, and a conditional ad banner above the nav for non-premium users.",
  "frontend/src/components/NotificationToast.tsx": "A fixed-position iOS-style toast notification that slides in from the top with the app logo and a message, supporting slide-in/out CSS animations and dismissal on click.",
  "frontend/src/components/PremiumModal.tsx": "Modal component for premium plan selection (monthly/yearly/lifetime) with promo code activation, email copy for purchase contact, bubble animations, and a congratulations screen on successful activation.",
  "frontend/src/components/RegistrationModal.tsx": "Onboarding modal that collects shop profile info (name, owner, phone, address, category) with validation, saves to localStorage, and supports skipping while marking registration as complete.",
  "frontend/src/components/ShoppingListPopup.tsx": "Bottom-sheet popup for managing a persistent shopping list with add, swipe-to-mark-bought, and delete functionality, storing items in localStorage.",
  "frontend/src/components/SplashScreen.tsx": "Animated splash screen with a progress bar that runs for 2.5 seconds before calling onComplete to proceed to the main app.",
  "frontend/src/components/TaskListPopup.tsx": "Bottom-sheet task manager where tasks are added, deleted, and completed via a 2-second press-and-hold gesture with confetti and bell sound feedback.",
  "frontend/src/components/TimerDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/TimerModal.tsx": "Empty file with no content.",
  "frontend/src/components/TodaysSalesPopup.tsx": "Bottom-sheet popup that reads today's sales from localStorage and displays total income, net profit, and an itemized sales list with color tags.",
  "frontend/src/contexts/LanguageContext.tsx": "React context providing bilingual (English/Bengali) support with a translation lookup function and language persistence via localStorage.",
  "frontend/src/contexts/NotificationContext.tsx": "Provides a React context for displaying notifications app-wide, wrapping the useNotification hook and rendering a NotificationToast component.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides a React context for managing light/dark theme mode and accent color, applying CSS custom properties to the document root when either changes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useClickSound.ts": "Provides click sound playback via the Web Audio API with support for custom uploaded sounds and enable/disable toggling, all persisted in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via AuthClient, exposing identity state, login/logout functions, and a React context provider for the entire app.",
  "frontend/src/hooks/useNotification.ts": "Manages transient notification state (visible/message) with auto-dismiss after 3.5 seconds and plays a notification sound, respecting a localStorage enable flag.",
  "frontend/src/hooks/useNotificationSound.ts": "Plays a notification chime using the Web Audio API or a custom base64 sound from localStorage, only when sound is enabled via a localStorage flag.",
  "frontend/src/hooks/usePremiumStatus.ts": "Tracks premium subscription status by reading activation timestamp from localStorage and enforcing a one-year expiry, clearing the flag when expired.",
  "frontend/src/hooks/useTimerNotification.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom property design tokens (colors, radius), base Tailwind directives, scrollbar styling, and keyframe animations used throughout the app.",
  "frontend/src/locales/translations.ts": "Defines English and Bangla translation strings for all UI text in the Smart Shop Ledger app, covering navigation, sales, history, profile, settings, premium, and notifications.",
  "frontend/src/main.tsx": "Entry point that renders the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AddSale.tsx": "Form page for adding a new sale with fields for product name, quantity, unit, prices, color tag, and optional image; enforces a 199-sale free-tier limit and saves to localStorage.",
  "frontend/src/pages/History.tsx": "Displays a searchable, date-filterable list of past sales from localStorage, showing today's profit summary and allowing individual sale deletion.",
  "frontend/src/pages/Home.tsx": "Dashboard page showing today's profit, income, items sold, and color-tag breakdown from localStorage sales, with quick-action buttons and popups for tasks, shopping list, and today's sales.",
  "frontend/src/pages/Lists.tsx": "Premium-gated 'Do To List' page that lets users add, toggle, and delete list items with optional price and notes, persisting data to localStorage.",
  "frontend/src/pages/ProductList.tsx": "React page for managing a product inventory stored in localStorage, with add/edit/delete functionality and a free-tier limit of 10 products enforced via a PremiumModal.",
  "frontend/src/pages/Profile.tsx": "React page for viewing and editing a shop owner's profile (name, phone, address, category, photo), persisting data to localStorage with dark/light theme support.",
  "frontend/src/pages/Settings.tsx": "React settings page allowing users to toggle dark mode, change accent color, switch language, enable/disable sound and notifications, upload a custom click sound, and access premium and developer info modals.",
  "frontend/src/utils/sounds.ts": "Web Audio API utility module that provides functions to play synthesized sounds including whoosh, soft click, bell, cash register, and bubble pop effects.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, CSS-variable-based colors, border radii, and keyframe animations (shake, slide-up, bubble-float), plus animate and typography plugins.",
  "project_state.json": "Project state manifest describing the Smart Shop Ledger app's architecture, AdMob integration details, known issues, required assets, and a versioned list of implemented features."
}