{
  "backend/main.mo": "Motoko actor that mixes in blob storage and manages premium activations, storing activation timestamps per user and checking 1-year expiry for premium status queries.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (dark mode persistence, PremiumModal redesign, premium-gated color tags, premium-gated navigation) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key behaviors of every component, page, context, and hook in the project.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme tokens including background, foreground, card, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the React app, loading the AdSense SDK, Hind Siliguri font, app icons, and mounting the root div with the main TSX module.",
  "frontend/src/App.tsx": "Root app component orchestrating the splash → registration → interstitial → main page flow, with global click-sound handling, custom navigation events, and premium expiry enforcement.",
  "frontend/src/components/AdBanner.tsx": "Simple ad banner component that renders a dismissible placeholder ad strip for non-premium users, hiding itself when the user has premium or dismisses it.",
  "frontend/src/components/AdMobBanner.tsx": "Google AdSense/AdMob banner component that initializes the ad slot once and renders an ins element for non-premium users, hiding entirely for premium users.",
  "frontend/src/components/BottomSheet.tsx": "Reusable bottom sheet modal component with slide-up animation, backdrop blur, optional title/close header, and whoosh/soft-click sound effects on open and close.",
  "frontend/src/components/CameraModal.tsx": "A modal component that activates the device camera using the `useCamera` hook, displays a live video preview, and captures a photo as a File on user request.",
  "frontend/src/components/CongratulationsAnimation.tsx": "Displays a full-screen confetti canvas animation with a bell sound and a Bangla congratulations message when a user activates premium, auto-dismissing after 3.5 seconds.",
  "frontend/src/components/DeveloperInfoModal.tsx": "A modal dialog that shows developer (MD JAHID HASAN RUBEL) and app metadata (Smart Shop Ledger v1.0.0) with dark/light theme support.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches render errors, logs them, and displays a bilingual (English/Bangla) fallback UI with a reload button.",
  "frontend/src/components/InterstitialAdScreen.tsx": "A full-screen interstitial ad screen with a 5-second countdown before allowing dismissal; premium users see a brief loading screen and are auto-redirected.",
  "frontend/src/components/Layout.tsx": "The main app shell providing a sticky header, scrollable content area, a bottom navigation bar with premium-locked items, and a conditional ad banner for non-premium users.",
  "frontend/src/components/NotificationToast.tsx": "A fixed-position iOS-style toast notification component that slides in/out with animation, showing the app logo, title, and a message string.",
  "frontend/src/components/PremiumModal.tsx": "A bottom-sheet modal for upgrading to premium, offering plan selection (monthly/yearly/lifetime) and promo code activation with hardcoded valid codes stored in localStorage.",
  "frontend/src/components/RegistrationModal.tsx": "A full-screen registration modal that collects shop name, owner name, phone, address, and category, saving the data to localStorage and marking registration as complete on submit or skip.",
  "frontend/src/components/ShoppingListPopup.tsx": "A bottom-sheet popup for managing a shopping list with add, swipe-to-mark-bought, and delete functionality, enforcing a 199-item limit for non-premium users.",
  "frontend/src/components/SplashScreen.tsx": "An animated splash screen displaying the app name and a progress bar over 2.5 seconds before calling an onComplete callback.",
  "frontend/src/components/TaskListPopup.tsx": "A bottom-sheet popup for managing a task list with add, long-press-to-complete, and delete functionality, enforcing a 199-task limit for non-premium users.",
  "frontend/src/components/TimerDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/TimerModal.tsx": "Empty file with no content.",
  "frontend/src/components/TodaysSalesPopup.tsx": "A bottom-sheet popup that reads today's sales from localStorage and displays a summary of total income and net profit alongside a detailed sales list with color tags.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for language switching between English and Bengali, with translation lookup via dot-notation keys and localStorage persistence.",
  "frontend/src/contexts/NotificationContext.tsx": "Provides a React context for displaying toast notifications, wrapping the useNotification hook and rendering a NotificationToast component.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides a React context for managing light/dark mode and theme color selection, persisting preferences to localStorage and applying CSS custom properties to the document root.",
  "frontend/src/hooks/useActor.ts": "Returns a cached ICP backend actor instance (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useClickSound.ts": "Provides click sound playback via Web Audio API with support for custom uploaded sounds stored as base64 in localStorage, plus enable/disable toggling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication for ICP using AuthClient, exposing login/logout functions, identity state, and a React context provider.",
  "frontend/src/hooks/useNotification.ts": "Manages transient notification state with auto-dismiss after 3.5 seconds, playing a notification sound and respecting a localStorage enable/disable flag.",
  "frontend/src/hooks/useNotificationSound.ts": "Plays a three-tone chime using the Web Audio API or a custom base64 sound from localStorage, gated by a sound-enabled flag.",
  "frontend/src/hooks/usePremiumStatus.ts": "Tracks premium subscription status by reading activation timestamp from localStorage and enforcing a one-year expiry, clearing expired premium flags automatically.",
  "frontend/src/hooks/useTimerNotification.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind directives, CSS custom properties for theming, scrollbar styles, and keyframe animations (slide-up, shake, bubble-float, confetti-fall).",
  "frontend/src/locales/translations.ts": "Defines English and Bangla translation strings for all UI text in the app, covering navigation, sales, history, profile, settings, premium, and product list labels.",
  "frontend/src/main.tsx": "Entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AddSale.tsx": "Form page for adding a new sale with fields for product name, quantity, prices, color tag, note, and image; enforces a 199-sale free-tier limit and gates color tags behind premium.",
  "frontend/src/pages/History.tsx": "Displays a searchable, date-filterable list of past sales from localStorage with today's profit summary and per-item delete functionality.",
  "frontend/src/pages/Home.tsx": "Dashboard page showing today's sales stats (profit, income, items sold, color-tag breakdown) and quick-action buttons to open task list, shopping list, and sales popups.",
  "frontend/src/pages/Lists.tsx": "Premium-gated task/item list page that lets users add items with retail price, wholesale price, and notes, storing them in localStorage with delete support.",
  "frontend/src/pages/ProductList.tsx": "React page for managing a product inventory list with add/edit/delete functionality, stored in localStorage. Premium status gates access; free tier is limited to 199 items.",
  "frontend/src/pages/Profile.tsx": "React page for viewing and editing shop profile data (name, owner, phone, address, category, photo), persisted to localStorage. Supports photo upload via FileReader and bilingual (EN/BN) labels.",
  "frontend/src/pages/Settings.tsx": "React settings page handling theme/color selection, language toggle, notification and sound toggles, custom sound upload, and CSV data export. Several features (premium themes, custom sound, data export) are locked behind premium status.",
  "frontend/src/utils/sounds.ts": "Utility module providing Web Audio API–based sound effects (click, bell, cash register, bubble pop, whoosh) using oscillators and noise buffers. Lazily initializes a shared AudioContext and silently swallows errors.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based colors, custom font (Hind Siliguri), border radii, and keyframe animations (shake, slide-up, bubble-float). Includes tailwindcss-animate, @tailwindcss/typography, and @tailwindcss/container-queries plugins.",
  "project_state.json": "Project state manifest (version 7) documenting the Smart Shop Ledger app's current version, architectural notes, known bugs, premium-locked features, promo codes, and fix requests for dark mode persistence and other issues."
}