{
  "backend/main.mo": "Main Motoko actor that includes a blob storage mixin for backend data persistence.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features including sale submission fixes, counter updates, flexible form validation, Bangladesh flag-inspired theme colors, and UI redesigns with their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing detailed summaries of all frontend source files including components, pages, contexts, hooks, and configuration files.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark themes with neutral grayscale values.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Root application component managing splash screen, registration modal, and page navigation with localStorage persistence and defensive error handling.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches errors, logs details to console, and displays bilingual error UI with reload button.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing fixed bottom navigation bar with five tabs (Home, Add Sale, History, Profile, Settings) and active state styling.",
  "frontend/src/components/RegistrationModal.tsx": "Shop registration dialog with six input fields (shop name, owner name, mobile, address, type, photo) that saves data to localStorage with skip option.",
  "frontend/src/components/SplashScreen.tsx": "Displays a splash screen with logo, app name, and tagline for 2.5 seconds before calling onComplete callback. Uses language context for translations and includes fade-in animations.",
  "frontend/src/components/TimerDisplay.tsx": "Shows a compact timer display that reads timer data from localStorage, updates remaining time every second, displays progress bar, and triggers notifications when timer completes. Expands on hover to show a clear button.",
  "frontend/src/components/TimerModal.tsx": "Modal dialog for setting a timer with hours and minutes inputs. Requests notification permission, saves timer data to localStorage, and displays success/error toasts.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides language context (English/Bengali) with localStorage persistence and translation function that retrieves nested translation keys from the translations object.",
  "frontend/src/contexts/ThemeContext.tsx": "Manages theme (light/dark) and theme color (red/green/black inspired by Bangladesh flag) with localStorage persistence and applies CSS custom properties to document root.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor with optional Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with AuthClient integration, managing login state, identity persistence, and delegation validation with configurable options.",
  "frontend/src/hooks/useTimerNotification.ts": "Hook for managing browser notification permissions and displaying timer completion notifications with localized title and body text.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines CSS custom properties for a red-themed design system (Bangladesh flag inspired) with light/dark mode support, plus custom fade-in and scale-in animations.",
  "frontend/src/locales/translations.ts": "Translation file exporting English and Bengali (bn) language strings for the entire app including navigation, registration, sales, history, profile, settings, and timer features.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AddSale.tsx": "Page component for adding new sales records with form inputs for item details, wholesale/selling prices, quantity, stock color indicators, and photo capture via camera or gallery upload, saving to localStorage.",
  "frontend/src/pages/History.tsx": "Page component displaying sales history with search and date filtering capabilities, loading records from localStorage with edit/delete actions and sorted by timestamp descending.",
  "frontend/src/pages/Home.tsx": "Home dashboard page showing today's profit and sales statistics calculated from localStorage, with quick action cards for navigation and optional timer display functionality.",
  "frontend/src/pages/Profile.tsx": "Profile page for viewing and editing shop information (name, owner, mobile, address, type, photo) with data persisted to localStorage and toggle between view/edit modes.",
  "frontend/src/pages/Settings.tsx": "Settings page component that provides UI for toggling dark/light mode, selecting theme colors (red/green/black), switching language (Bangla/English), and enabling/disabling a timer feature with localStorage persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color system using OKLCH color space with CSS variables, custom animations (accordion, fade-in, scale-in), and extended theme properties for the UI design system.",
  "project_state.json": "Project state document describing a Smart Shop Ledger app with three-phase development plan, architectural decisions (React/TypeScript frontend, Motoko backend, Internet Identity auth), and tracking two known issues with Add Sale functionality."
}