{
  "kind": "build_request",
  "title": "Full rebuild: notifications, ads, premium redesign, language-aware UI, and new splash logo",
  "projectName": "Smart Shop Ledger",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix in-app toast notifications so they appear after any task or trust completion. The toast must display for exactly 3 seconds then auto-dismiss, slide in from the top with a smooth animation, show the app logo and a relevant message, support click-to-dismiss, and respect the active language (Bengali or English). Use a polished, visually distinct design consistent with the app theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ]
      },
      "acceptanceCriteria": [
        "Toast appears every time a task or trust item is completed",
        "Toast auto-dismisses after exactly 3 seconds",
        "Toast slides in from the top with animation and slides out on dismiss",
        "Message text is in Bengali when Bengali is selected, English when English is selected",
        "Clicking the toast dismisses it immediately"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Place a visible ad banner at the very bottom of the Home screen (above the bottom navigation bar), visible only to non-premium users. The banner must always be visible and not hidden by default.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ]
      },
      "acceptanceCriteria": [
        "Ad banner is rendered at the bottom of the Home page above the nav bar",
        "Banner is not shown to premium users",
        "Banner is visible and not auto-dismissed"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Place a visible ad banner at the very bottom of the History page. As new history entries are added, they stack upward while the banner stays fixed at the bottom. The banner must be visible only to non-premium users and must not be hidden or auto-dismissed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-3"
        ]
      },
      "acceptanceCriteria": [
        "Ad banner is rendered at the bottom of the History page",
        "History items grow upward above the banner as more are added",
        "Banner is not shown to premium users",
        "Banner is always visible and not auto-dismissed"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Redesign the premium section to match the layout shown in the uploaded screenshots. The outer card (Settings page) must show: a crown icon + 'Premium' title, subtitle 'Unlock all premium features', the free/premium limit line, a checklist of 7 features (Unlimited Products, Unlimited Sales (Free: 199 limit), Advanced Reports, Data Backup & Sync, Priority Support, Custom Themes, DO TO LIST (Unlimited)), and at the bottom a full-width 'Get Premium' button. Replace the top-right 'Buy' button with a styled offer tag reading '🔥 অফার! ১০০ টাকায় ১ বছর' (or English equivalent when language is English). Clicking this offer tag must automatically copy 'mdjahidhasanrubel73@gmail.com' to clipboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-7",
          "msg-9",
          "msg-11"
        ]
      },
      "acceptanceCriteria": [
        "Outer premium card matches the layout in Screenshot 1",
        "Offer tag '🔥 অফার! ১০০ টাকায় ১ বছর' replaces the old 'Buy' button",
        "Clicking the offer tag copies mdjahidhasanrubel73@gmail.com to clipboard silently",
        "All 7 feature checklist items are displayed",
        "'Get Premium' button opens the premium modal"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Redesign the premium modal to match Screenshot 2. The modal must include: crown emoji + 'Premium' title, close button, 7-item feature checklist, a '⏰ Premium stays active for up to 1 year. It will automatically reset after 1 year.' info box, two tabs ('Promo Code' and 'Purchase Code'), a code input field, and an orange 'Activate' button. Valid promo codes are '987987' and '789789'. Valid purchase password is 'RUBELBOSS987'. Add an email icon/button that when clicked copies 'mdjahidhasanrubel73@gmail.com' to clipboard and opens the device email app with that address pre-filled as recipient. Add a 'Trial' button that grants 1 minute of premium access, usable only once per device (stored in localStorage); after the trial is used, the button is disabled/hidden permanently on that device.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-7",
          "msg-9",
          "msg-11"
        ]
      },
      "acceptanceCriteria": [
        "Modal layout matches Screenshot 2 with dark background, gold accents",
        "Promo Code tab accepts 987987 or 789789 and activates premium on correct code",
        "Purchase Code tab accepts RUBELBOSS987 and activates premium",
        "Wrong codes show an error message",
        "Email icon click copies mdjahidhasanrubel73@gmail.com and opens mailto: link",
        "Trial button grants 1-minute premium, disabled after first use on the device",
        "After successful activation, CongratulationsAnimation is shown"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure the entire app UI (all pages, modals, buttons, labels, placeholders, error messages) renders in Bengali when Bengali is selected in Settings, and in English when English is selected. The language switch must apply immediately app-wide without a reload, using the existing LanguageContext and translations.ts. Any missing translation keys for new UI elements (offer tag, trial button, email copy feedback, etc.) must be added to both language sets in translations.ts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ]
      },
      "acceptanceCriteria": [
        "Switching language in Settings immediately updates all visible text",
        "All new UI elements (offer tag, trial button, email copy feedback) have Bengali and English translations",
        "No hardcoded UI strings outside translations.ts"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Redesign the splash screen logo in SplashScreen.tsx. Replace the current logo with a new, professionally designed logo for 'Smart Shop Ledger'. The logo must be visually distinct: use a shop/ledger icon motif, incorporate green (Bangladesh-inspired) as the primary brand color, have clean modern typography for the app name, and look polished at splash-screen scale. The new logo image must be rendered from the generated asset in frontend/public/assets/generated/. The rest of the splash screen (progress bar, animation timing) remains unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12",
          "msg-14"
        ]
      },
      "acceptanceCriteria": [
        "Old logo is fully replaced by the new logo asset",
        "New logo displays correctly at splash screen size without distortion",
        "Logo uses the green brand color scheme",
        "Splash screen animation timing (2.5 seconds) is unchanged"
      ]
    }
  ],
  "constraints": [
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "All premium code validation (promo codes, password) must remain client-side in localStorage only",
    "Trial feature must use localStorage to track per-device usage — once used, permanently disabled on that device",
    "Language selection must use the existing LanguageContext — do not create a parallel language system"
  ],
  "nonGoals": [
    "No real payment processing integration",
    "No backend changes for premium status (keep localStorage-based)",
    "No push/browser notifications — only in-app toast",
    "No new pages or navigation tabs",
    "No changes to the bottom navigation bar structure"
  ],
  "imageRequirements": {
    "required": [
      "Smart Shop Ledger app logo: a modern icon combining a small shop storefront silhouette with an open ledger/book, bold green (#2D8A4E) primary color with white accents, clean sans-serif 'Smart Shop Ledger' text below the icon, on a transparent background (ssl-logo.dim_512x512.png)"
    ],
    "edits": []
  }
}