{
  "kind": "build_request",
  "title": "Redesign Sound Button, Add Premium Codes, and Unit Selector for Quantity Fields",
  "projectName": "Smart Shop Ledger",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Redesign the sound toggle/change button in the Settings page with a new visually appropriate design. The button should clearly communicate its function (sound control) through iconography and styling. Replace the existing button UI with the new design while preserving the underlying sound enable/disable and custom sound upload functionality from useClickSound.ts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "সেই বাটনটাকে চেঞ্জ করে নতুন একটি ডিজাইন বাটন দিবে যেটা কিনা তার জন্য পারফেক্ট থাকবে"
        ]
      },
      "acceptanceCriteria": [
        "The sound button in Settings page has a new visually distinct design with an appropriate icon (e.g., speaker/sound icon)",
        "The button clearly conveys its sound-related function",
        "Clicking the button still toggles sound on/off as before",
        "Custom sound upload functionality remains intact",
        "The new design fits cohesively within the Settings page layout"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the previously planned premium access codes 987789 and 879987 with 4 new well-designed codes in PremiumModal.tsx. All 4 new codes must work exactly like the existing code 987987 — granting full premium access when entered. The original code 987987 must remain valid. Generate the 4 new codes following a consistent, memorable pattern.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "নতুন কোড হিসেবে ঠিক আছে তুমিও চাইলে আরো দুটো নতুন কোড ডিজাইন করতে পারো এবং আমি যে নতুন দুইটা কোড দিয়েছে সেটাকে পরিবর্তন করে দিতে পারো এগুলো আগের কোডের মতই কাজ করবে"
        ]
      },
      "acceptanceCriteria": [
        "PremiumModal accepts 4 new premium codes in addition to the original 987987",
        "Entering any of the 5 valid codes (987987 + 4 new ones) unlocks premium features",
        "The 4 new codes replace the previously requested 987789 and 879987 codes",
        "Invalid codes still show an error message",
        "Premium unlock state is persisted in localStorage"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a unit selector to quantity/measurement input fields in the AddSale page and ProductList page. Next to each quantity input field, display a small icon/button. Clicking this icon opens a dropdown with unit options: gram, kg, liter. The displayed unit labels must respect the current app language — showing Bengali labels (গ্রাম, কেজি, লিটার) when Bengali is active, and English labels (gram, kg, liter) when English is active, using the existing LanguageContext and translations system. The selected unit should be stored alongside the quantity value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "পরিমাণ হিসেবে ধরে নেওয়া একটা চিহ্ন থাকলেও সেটাতে ক্লিক করার পর অপশন আসবে কি এই গ্রাম নাকি লিটার এখন ইংলিশ বাংলা অপশনের মাধ্যমে এটা কোন ভাষায় দেখাবে কে যে গ্রাম অপশন ঠিক আছে এটা তোমার নির্ভর করে তুমি ইংলিশ সিলেট করেছো নাকি বাংলা"
        ]
      },
      "acceptanceCriteria": [
        "A unit selector icon appears next to quantity input fields in AddSale and ProductList pages",
        "Clicking the icon opens a dropdown showing unit options: gram, kg, liter",
        "When app language is Bengali, units display as গ্রাম, কেজি, লিটার",
        "When app language is English, units display as gram, kg, liter",
        "Switching app language updates the unit dropdown labels immediately",
        "The selected unit is saved/stored alongside the quantity value",
        "The quantity input still accepts numeric values normally"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add translation keys for the unit selector options (gram, kg, liter in both English and Bengali) to the translations object in frontend/src/locales/translations.ts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "ইংলিশ বাংলা অপশনের মাধ্যমে এটা কোন ভাষায় দেখাবে"
        ]
      },
      "acceptanceCriteria": [
        "translations.ts contains English entries: gram, kg, liter",
        "translations.ts contains Bengali entries: গ্রাম, কেজি, লিটার",
        "The translation keys are accessible via the existing translation lookup function in LanguageContext"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "The existing premium code 987987 must remain valid after adding new codes",
    "Unit selector must use the existing LanguageContext — do not create a separate language system"
  ],
  "nonGoals": [
    "Backend changes — all data remains in localStorage",
    "Adding new pages or navigation tabs",
    "Changing the overall app theme or color scheme",
    "Real-time sync or cloud storage of sales/product data"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}