{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Redesign Sound Button, Add Premium Codes, and Unit Selector for Quantity Fields",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Redesign the sound toggle button in the Settings page with new visually appropriate iconography and styling while preserving existing sound enable/disable and custom sound upload functionality",
      "acceptanceCriteria": [
        "The sound button in Settings page has a new visually distinct design with an appropriate icon (e.g., speaker/sound icon)",
        "The button clearly conveys its sound-related function",
        "Clicking the button still toggles sound on/off as before",
        "Custom sound upload functionality remains intact",
        "The new design fits cohesively within the Settings page layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Replace the existing sound toggle button UI with a new visually appropriate design featuring clear sound iconography (speaker icon with sound waves). Update the button styling to make it more prominent and visually distinct. Ensure the redesigned button still integrates with useClickSound hook for toggling sound state and handling custom sound upload. Keep all existing functionality intact while improving the visual design and user experience."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add 4 new premium access codes to PremiumModal.tsx that work exactly like the existing 987987 code, replacing the previously planned codes",
      "acceptanceCriteria": [
        "PremiumModal accepts 4 new premium codes in addition to the original 987987",
        "Entering any of the 5 valid codes (987987 + 4 new ones) unlocks premium features",
        "The 4 new codes replace the previously requested 987789 and 879987 codes",
        "Invalid codes still show an error message",
        "Premium unlock state is persisted in localStorage"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PremiumModal.tsx",
          "operation": "modify",
          "description": "Add 4 new premium access codes following a consistent, memorable pattern (e.g., 123321, 456654, 789987, 321123). Update the code validation logic to accept all 5 codes: the original 987987 plus the 4 new codes. Ensure each code grants full premium access when entered, with the unlock state persisted in localStorage. Keep the invalid code error message behavior unchanged."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a bilingual unit selector (gram/kg/liter) next to quantity input fields in AddSale and ProductList pages that respects the current app language using LanguageContext",
      "acceptanceCriteria": [
        "A unit selector icon appears next to quantity input fields in AddSale and ProductList pages",
        "Clicking the icon opens a dropdown showing unit options: gram, kg, liter",
        "When app language is Bengali, units display as গ্রাম, কেজি, লিটার",
        "When app language is English, units display as gram, kg, liter",
        "Switching app language updates the unit dropdown labels immediately",
        "The selected unit is saved/stored alongside the quantity value",
        "The quantity input still accepts numeric values normally"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddSale.tsx",
          "operation": "modify",
          "description": "Add a unit selector icon/button next to the quantity input field. Implement a dropdown menu that opens when the icon is clicked, showing three unit options: gram, kg, liter. Use the existing LanguageContext and translation keys (unitGram, unitKg, unitLiter) to display Bengali labels (গ্রাম, কেজি, লিটার) or English labels (gram, kg, liter) based on the current app language. Store the selected unit alongside the quantity value in the sale data structure saved to localStorage. Ensure the quantity input continues to accept numeric values normally and the unit selector updates immediately when the app language is switched."
        },
        {
          "path": "frontend/src/pages/ProductList.tsx",
          "operation": "modify",
          "description": "Add a unit selector icon/button next to the quantity/measurement input field in the product form (both add and edit modes). Implement a dropdown menu that opens when the icon is clicked, showing three unit options: gram, kg, liter. Use the existing LanguageContext and translation keys (unitGram, unitKg, unitLiter) to display Bengali labels (গ্রাম, কেজি, লিটার) or English labels (gram, kg, liter) based on the current app language. Store the selected unit alongside the quantity value in the product data structure saved to localStorage. Ensure the quantity input continues to accept numeric values normally and the unit selector updates immediately when the app language is switched."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add translation keys for unit selector options (gram, kg, liter) in both English and Bengali to the translations object",
      "acceptanceCriteria": [
        "translations.ts contains English entries: gram, kg, liter",
        "translations.ts contains Bengali entries: গ্রাম, কেজি, লিটার",
        "The translation keys are accessible via the existing translation lookup function in LanguageContext"
      ],
      "file_operations": [
        {
          "path": "frontend/src/locales/translations.ts",
          "operation": "modify",
          "description": "Add three new translation key pairs to the translations object: 'unitGram' with English value 'gram' and Bengali value 'গ্রাম', 'unitKg' with English value 'kg' and Bengali value 'কেজি', and 'unitLiter' with English value 'liter' and Bengali value 'লিটার'. Place these keys in a logical location within the existing translations structure, ensuring they are accessible via the translation lookup function in LanguageContext."
        }
      ]
    }
  ]
}