{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Add Sale functionality, redesign UI components, and add Timer/Reminder feature",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Fix Add Sale Submit button to properly save sale data to localStorage and ensure the saved data appears in the History screen immediately after submission",
      "acceptanceCriteria": [
        "When Submit button is clicked on Add Sale screen, sale data must be saved to localStorage",
        "Saved sale must appear in History screen immediately without refresh",
        "localStorage data structure must be consistent across Add Sale and History components"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddSale.tsx",
          "operation": "modify",
          "description": "Fix the handleSubmit function to properly save sale records to localStorage under a consistent key 'sales'. Ensure the sale object includes all form fields (itemName, quantity, costPrice, salePrice, profit, stockColor, photo, date, id). Add proper error handling and success feedback. After successful save, navigate to History page or show confirmation message."
        },
        {
          "path": "frontend/src/pages/History.tsx",
          "operation": "modify",
          "description": "Update the component to read sales data from localStorage using the same key 'sales' that AddSale uses. Replace placeholder/mock data with actual localStorage data. Ensure the component re-renders when navigating from AddSale after a new sale is added. Add proper null/empty state handling."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Update Today's Sales counter on Home screen to increment properly when new sales are added through Add Sale form",
      "acceptanceCriteria": [
        "Today's Sales card on Home screen must read from the same localStorage data as History screen",
        "Counter must update automatically when a new sale is added",
        "Counter must show the count of sales for today's date only"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Modify Today's Sales card to read sales data from localStorage key 'sales', filter by today's date, and display the count. Add useEffect to re-calculate when component mounts or when navigating back from AddSale. Calculate Today's Profit by summing profit values from today's sales. Ensure proper date comparison logic (compare date strings or timestamps)."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Make Add Sale form flexible by allowing submission with any one or more fields filled - do not require all fields to be completed before submitting",
      "acceptanceCriteria": [
        "Submit button must work if even one field is filled in the Add Sale form",
        "Empty fields should be stored with empty strings or default values (0 for prices)",
        "Form validation should only check that at least one field has data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddSale.tsx",
          "operation": "modify",
          "description": "Remove or modify validation logic to only check that at least one field (itemName, quantity, costPrice, salePrice, photo, or stockColor) is non-empty. Allow submission with partial data. Store empty fields as empty strings for text fields and 0 for numeric fields. Update the form validation function accordingly."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Replace the existing theme color options (Orange Sunset, Red Passion, Golden Amber) with simplified color options: Red, Green, and Black inspired by the Bangladesh flag",
      "acceptanceCriteria": [
        "Settings screen Theme Color section must show three options: Red, Green, Black",
        "Remove Orange Sunset, Red Passion, and Golden Amber color schemes",
        "Red and Green should use colors inspired by Bangladesh flag (red: #F42A41, green: #006A4E)",
        "Selecting a color must properly apply it throughout the app UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/ThemeContext.tsx",
          "operation": "modify",
          "description": "Update ThemeColor type to include 'red', 'green', and 'black' instead of 'orange', 'red', and 'amber'. Update the applyThemeColor function to apply the new color schemes. Use Bangladesh flag colors: red (#F42A41), green (#006A4E), and a black theme. Update CSS variable mappings for each color scheme."
        },
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Replace the three theme color options (Orange Sunset, Red Passion, Golden Amber) with Red, Green, and Black. Update button labels and display colors accordingly. Ensure the selected color scheme is properly highlighted and applied via ThemeContext."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define CSS custom properties for the new color schemes: red (#F42A41), green (#006A4E), and black. Replace existing orange-based color variables with the new Bangladesh flag-inspired palette. Ensure proper contrast for text readability in all three themes."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Redesign the Quick Actions section on Home screen with improved visual design for the two action buttons (Add New Sale and View History)",
      "acceptanceCriteria": [
        "Quick Actions buttons must have enhanced visual design with better spacing and styling",
        "Buttons should remain touch-friendly and clearly labeled",
        "Design should be consistent with the overall app visual theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Redesign the Quick Actions section by improving button styling with enhanced shadows, rounded corners, gradient backgrounds, better icon sizing, and improved spacing. Ensure buttons are visually distinct and maintain mobile-first touch-friendly sizing (minimum 48px touch target). Use consistent design language with the rest of the app."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Improve the design of the Splash screen tagline text 'Manage your shop efficiently' while keeping the same text content, and display it in Bangla or English based on the user's language setting in Settings",
      "acceptanceCriteria": [
        "Splash screen tagline must remain 'Manage your shop efficiently' in English",
        "Tagline must be translated to Bangla when language setting is Bangla",
        "Tagline design (typography, sizing, spacing) must be improved for better visual appeal",
        "Language displayed must be determined by the Settings language selection"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SplashScreen.tsx",
          "operation": "modify",
          "description": "Import useLanguage hook from LanguageContext and use t() function to display the tagline in the selected language. Improve tagline typography by increasing font size, adding letter spacing, using a better font weight, and adding subtle animation effects. Ensure the tagline is visually prominent and well-positioned below the logo."
        },
        {
          "path": "frontend/src/locales/translations.ts",
          "operation": "modify",
          "description": "Ensure the splash screen tagline 'Manage your shop efficiently' exists in the English translations and add the Bangla translation if not already present. Verify the translation key is accessible for the SplashScreen component."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Add a Timer/Reminder enable/disable toggle in the Settings screen that allows users to turn the Timer/Reminder feature on or off",
      "acceptanceCriteria": [
        "Settings screen must include a toggle switch labeled 'Timer/Reminder' or similar",
        "Toggle state must be saved to localStorage and persist across sessions",
        "When enabled, Timer component must appear on Home screen",
        "When disabled, Timer component must be hidden from Home screen"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Add a new Timer/Reminder section with a toggle switch. Store the toggle state in localStorage under key 'timerEnabled'. Add proper labels in both English and Bangla. Ensure the toggle state persists across sessions and is properly initialized from localStorage on component mount."
        },
        {
          "path": "frontend/src/locales/translations.ts",
          "operation": "modify",
          "description": "Add translation keys for Timer/Reminder settings section including toggle label, description text, and related UI text in both English and Bangla."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Create a Dynamic Island-style compact timer display component that appears below the Quick Actions section on the Home screen when Timer/Reminder is enabled in Settings",
      "acceptanceCriteria": [
        "Timer component must appear below Quick Actions section on Home screen when enabled",
        "Component must be compact and styled in black color, inspired by iPhone Dynamic Island design",
        "Timer display size should adapt based on remaining time or timer state",
        "Component must be clickable to open the timer setting modal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TimerDisplay.tsx",
          "operation": "create",
          "description": "Create a new compact timer display component styled like iPhone Dynamic Island. Use black background, rounded pill shape, subtle shadow, and animated transitions. Display remaining time in a readable format (e.g., '5:30' for 5 minutes 30 seconds or '1h 23m' for longer times). Component should be clickable and emit an onClick event to open the timer modal. Size should adapt based on timer state (e.g., slightly larger when active)."
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Import TimerDisplay component and conditionally render it below the Quick Actions section when timerEnabled is true in localStorage. Pass timer state and onClick handler to open the timer setting modal. Ensure proper spacing and layout integration."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Create a timer setting modal that opens when the user clicks on the timer display component on the Home screen, allowing them to set reminder time in minutes or hours",
      "acceptanceCriteria": [
        "Clicking the timer display on Home screen must open a modal/popup",
        "Modal must include input fields for setting time in minutes and/or hours",
        "Modal must include a 'Set Reminder' button to save the timer",
        "Modal must include a 'Cancel' button to close without saving",
        "Timer data must be saved to localStorage when set"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TimerModal.tsx",
          "operation": "create",
          "description": "Create a modal component for timer/reminder settings. Include input fields for hours and minutes, 'Set Reminder' and 'Cancel' buttons. Support bilingual labels using LanguageContext. On submit, calculate target timestamp and save to localStorage under key 'timerData' with structure: { targetTime: timestamp, startTime: timestamp, duration: number }. Include validation to ensure at least one field is non-zero. Close modal after successful save."
        },
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add state to manage TimerModal visibility. Pass modal open/close handlers to TimerDisplay. Render TimerModal component with proper state management. After timer is set via modal, update TimerDisplay to show the countdown."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Implement browser notification system that triggers when a timer reaches zero, displaying a notification to the user about the reminder they set",
      "acceptanceCriteria": [
        "When timer countdown reaches zero, a browser notification must be displayed",
        "Notification must request permission from the user on first use",
        "Notification text should indicate what the reminder was for (e.g., 'Time to eat' or generic reminder message)",
        "No alarm sound should play - only visual browser notification"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useTimerNotification.ts",
          "operation": "create",
          "description": "Create a custom hook that manages browser notifications for timer completion. Request notification permission on first use. Provide a function to trigger notification when timer reaches zero. Notification title should use bilingual text (e.g., 'Timer Complete' or 'সময় শেষ'). Include a generic reminder message body. Handle permission denied gracefully."
        },
        {
          "path": "frontend/src/components/TimerDisplay.tsx",
          "operation": "modify",
          "description": "Import and use useTimerNotification hook. When countdown reaches zero, trigger the browser notification and clear the timer data from localStorage. Optionally show a visual indicator that the timer has completed."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Update timer display component to show countdown in real-time, updating every second or minute based on the remaining time until the reminder",
      "acceptanceCriteria": [
        "Timer must count down in real-time and update the display",
        "Display format should adapt based on remaining time (e.g., show hours if more than 60 minutes remain)",
        "When timer reaches zero, it should stop and trigger the notification"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TimerDisplay.tsx",
          "operation": "modify",
          "description": "Implement countdown logic using useEffect and setInterval. Read timerData from localStorage on mount. Calculate remaining time by comparing current time with targetTime. Update display every second. Format time display adaptively: show hours and minutes for long durations, show minutes and seconds for under 1 hour, show only seconds for under 1 minute. When remaining time reaches zero, trigger notification and clear timer. Clean up interval on unmount."
        }
      ]
    }
  ]
}