{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Full rebuild: notifications, ads, premium redesign, language-aware UI, and new splash logo",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix in-app toast notifications to appear after task/trust completion with 3-second auto-dismiss, slide-in animation, app logo, language-aware messages, and click-to-dismiss support",
      "acceptanceCriteria": [
        "Toast appears every time a task or trust item is completed",
        "Toast auto-dismisses after exactly 3 seconds",
        "Toast slides in from the top with animation and slides out on dismiss",
        "Message text is in Bengali when Bengali is selected, English when English is selected",
        "Clicking the toast dismisses it immediately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/NotificationToast.tsx",
          "operation": "modify",
          "description": "Update the NotificationToast component to enforce exactly 3-second auto-dismiss timing (currently 3.5s), ensure slide-in/slide-out animations work correctly, display the app logo, accept language-aware message text, and support immediate dismissal on click. Verify that CSS keyframes in index.css support the animation requirements."
        },
        {
          "path": "frontend/src/hooks/useNotification.ts",
          "operation": "modify",
          "description": "Update the useNotification hook to enforce exactly 3-second auto-dismiss timing (adjust from current 3.5s) and ensure it integrates with the LanguageContext to pass language-aware messages to the NotificationToast."
        },
        {
          "path": "frontend/src/components/TaskListPopup.tsx",
          "operation": "modify",
          "description": "Wire the notification system to trigger a toast when a task is completed via the 2-second press-and-hold gesture. Use the NotificationContext to show a language-aware completion message from translations.ts."
        },
        {
          "path": "frontend/src/locales/translations.ts",
          "operation": "modify",
          "description": "Add translation keys for task completion and trust completion toast messages in both English and Bengali. Include keys like 'taskCompleted', 'trustCompleted' with appropriate congratulatory text."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Place a visible ad banner at the very bottom of the Home screen above the bottom navigation bar, visible only to non-premium users",
      "acceptanceCriteria": [
        "Ad banner is rendered at the bottom of the Home page above the nav bar",
        "Banner is not shown to premium users",
        "Banner is visible and not auto-dismissed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add a visible ad banner component (AdMobBanner or AdBanner) at the bottom of the Home page, positioned above the bottom navigation bar. Ensure it is only rendered for non-premium users by checking usePremiumStatus. The banner must be visible by default and not auto-dismissed."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Place a visible ad banner at the very bottom of the History page, fixed below all history entries, visible only to non-premium users",
      "acceptanceCriteria": [
        "Ad banner is rendered at the bottom of the History page",
        "History items grow upward above the banner as more are added",
        "Banner is not shown to premium users",
        "Banner is always visible and not auto-dismissed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/History.tsx",
          "operation": "modify",
          "description": "Add a visible ad banner component (AdMobBanner or AdBanner) at the bottom of the History page, ensuring it remains fixed below all history entries. As new entries are added, they should stack upward while the banner stays at the bottom. Only render the banner for non-premium users by checking usePremiumStatus. The banner must be visible by default and not auto-dismissed."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Redesign the premium section card on the Settings page to match the uploaded screenshot layout with crown icon, 7-feature checklist, and offer tag that copies email on click",
      "acceptanceCriteria": [
        "Outer premium card matches the layout in Screenshot 1",
        "Offer tag '🔥 অফার! ১০০ টাকায় ১ বছর' replaces the old 'Buy' button",
        "Clicking the offer tag copies mdjahidhasanrubel73@gmail.com to clipboard silently",
        "All 7 feature checklist items are displayed",
        "'Get Premium' button opens the premium modal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Redesign the premium section card to match the layout shown in Screenshot_20260225_213431_Chrome.jpg. Add a crown icon and 'Premium' title, subtitle 'Unlock all premium features', the free/premium limit line, a 7-item feature checklist (Unlimited Products, Unlimited Sales (Free: 199 limit), Advanced Reports, Data Backup & Sync, Priority Support, Custom Themes, DO TO LIST (Unlimited)), and a full-width 'Get Premium' button. Replace the top-right 'Buy' button with a styled offer tag reading '🔥 অফার! ১০০ টাকায় ১ বছর' (Bengali) or '🔥 Offer! 1 Year for 100 Taka' (English) based on the active language from LanguageContext. Implement click handler on the offer tag to silently copy 'mdjahidhasanrubel73@gmail.com' to the clipboard using navigator.clipboard.writeText."
        },
        {
          "path": "frontend/src/locales/translations.ts",
          "operation": "modify",
          "description": "Add translation keys for the offer tag text, premium card subtitle, and all 7 feature checklist items in both English and Bengali. Include keys like 'premiumOfferTag', 'premiumSubtitle', 'featureUnlimitedProducts', 'featureUnlimitedSales', 'featureAdvancedReports', 'featureDataBackup', 'featurePrioritySupport', 'featureCustomThemes', 'featureDoToList'."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Redesign the premium modal to match Screenshot 2 with crown emoji, 7-item checklist, info box, Promo Code/Purchase Code tabs, email icon/button, and Trial button with 1-minute access",
      "acceptanceCriteria": [
        "Modal layout matches Screenshot 2 with dark background, gold accents",
        "Promo Code tab accepts 987987 or 789789 and activates premium on correct code",
        "Purchase Code tab accepts RUBELBOSS987 and activates premium",
        "Wrong codes show an error message",
        "Email icon click copies mdjahidhasanrubel73@gmail.com and opens mailto: link",
        "Trial button grants 1-minute premium, disabled after first use on the device",
        "After successful activation, CongratulationsAnimation is shown"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PremiumModal.tsx",
          "operation": "modify",
          "description": "Redesign the modal to match Screenshot_20260225_213446_Chrome.jpg. Add crown emoji + 'Premium' title, close button, 7-item feature checklist, info box with '⏰ Premium stays active for up to 1 year. It will automatically reset after 1 year.', two tabs ('Promo Code' and 'Purchase Code'), code input field, and orange 'Activate' button. Implement promo code validation for '987987' and '789789', purchase code validation for 'RUBELBOSS987', and show error messages for invalid codes. Add an email icon/button that copies 'mdjahidhasanrubel73@gmail.com' to clipboard and opens mailto: link. Add a 'Trial' button that grants 1-minute premium access (stored in localStorage with timestamp), usable only once per device (check localStorage flag 'trialUsed'); after the trial is used, disable/hide the button permanently. On successful activation, show the CongratulationsAnimation component. Use LanguageContext for all text."
        },
        {
          "path": "frontend/src/hooks/usePremiumStatus.ts",
          "operation": "modify",
          "description": "Extend the usePremiumStatus hook to support 1-minute trial activation. Add logic to check for a trial timestamp in localStorage and enforce a 1-minute expiry. Ensure the trial flag is cleared after expiry and the 'trialUsed' flag is set permanently after the trial is activated once."
        },
        {
          "path": "frontend/src/locales/translations.ts",
          "operation": "modify",
          "description": "Add translation keys for the premium modal: crown title, close button, 7-item checklist, info box text, tab labels ('Promo Code', 'Purchase Code'), input placeholder, activate button, error messages, email button label, trial button text, and trial success/expiry messages in both English and Bengali."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Ensure the entire app UI renders in Bengali or English based on the language selection in Settings, with immediate app-wide updates and all new UI elements translated",
      "acceptanceCriteria": [
        "Switching language in Settings immediately updates all visible text",
        "All new UI elements (offer tag, trial button, email copy feedback) have Bengali and English translations",
        "No hardcoded UI strings outside translations.ts"
      ],
      "file_operations": [
        {
          "path": "frontend/src/locales/translations.ts",
          "operation": "modify",
          "description": "Review all new UI elements added in REQ-1, REQ-4, and REQ-5 and ensure every string (offer tag, trial button, email copy feedback, toast messages, premium modal text, checklist items, error messages, etc.) has both English and Bengali translations. Add any missing keys for new UI elements introduced in this rebuild."
        },
        {
          "path": "frontend/src/components/NotificationToast.tsx",
          "operation": "modify",
          "description": "Ensure the NotificationToast component uses the translate function from LanguageContext to display language-aware messages. Verify no hardcoded strings remain."
        },
        {
          "path": "frontend/src/components/PremiumModal.tsx",
          "operation": "modify",
          "description": "Ensure all text in the PremiumModal (title, checklist, tabs, buttons, error messages, info box, email feedback) uses the translate function from LanguageContext. Verify no hardcoded strings remain."
        },
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Ensure the redesigned premium card section uses the translate function from LanguageContext for all text (title, subtitle, checklist, offer tag, button). Verify no hardcoded strings remain."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Redesign the splash screen logo with the new professionally designed 'Smart Shop Ledger' logo asset using green brand color and shop/ledger icon motif",
      "acceptanceCriteria": [
        "Old logo is fully replaced by the new logo asset",
        "New logo displays correctly at splash screen size without distortion",
        "Logo uses the green brand color scheme",
        "Splash screen animation timing (2.5 seconds) is unchanged"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SplashScreen.tsx",
          "operation": "modify",
          "description": "Replace the current logo in the splash screen with the new professionally designed logo asset from frontend/public/assets/generated/ssl-logo.dim_512x512.png. Ensure the logo is rendered at the correct size without distortion, uses the green brand color scheme, and maintains the 2.5-second animation timing. Update the img src to reference the exact workspace path: frontend/public/assets/generated/ssl-logo.dim_512x512.png."
        }
      ]
    }
  ]
}