{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Dark Mode Persistence, Revert Premium Modal Design, and Enforce Premium Locks",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Fix dark mode persistence using localStorage so the theme state is restored on app reopening",
      "acceptanceCriteria": [
        "When user enables dark mode and closes/reopens the app, dark mode is still active",
        "When user disables dark mode and closes/reopens the app, light mode is still active",
        "ThemeContext initializes dark mode state from localStorage key (e.g., 'darkMode') on mount",
        "Every dark mode toggle writes the new value to localStorage immediately"
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/ThemeContext.tsx",
          "operation": "modify",
          "description": "Modify ThemeContext to read dark mode state from localStorage on initialization (using key 'darkMode') and write the new dark mode value to localStorage immediately on every toggle. Ensure the isDarkMode state is synchronized with localStorage throughout the component lifecycle."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Revert PremiumModal visual design back to Version 27 style while preserving all promo code logic and pricing",
      "acceptanceCriteria": [
        "PremiumModal visually matches the Version 27 design (original color scheme, layout, card styling)",
        "All existing promo codes (987987, 789789, 2580, 01736026413, 01859040014) still work",
        "Monthly, yearly, and lifetime plan options are still displayed",
        "The promo code activation flow still functions correctly"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PremiumModal.tsx",
          "operation": "modify",
          "description": "Revert the PremiumModal component's visual design (color scheme, layout, card styles, typography, button styles) back to Version 27 appearance. Do not modify promo code validation logic, pricing values, plan options, or the activation flow. Focus only on restoring the original UI styling and structure."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Lock color categorization feature behind premium; show PremiumModal when free users attempt to use color tags",
      "acceptanceCriteria": [
        "Free users cannot use the color tag/color categorization feature when adding a sale",
        "Tapping the color tag option as a free user opens the PremiumModal",
        "Premium users can use color categorization without any restriction",
        "The home screen color breakdown section is visible to all users but color tagging during add is locked for free users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddSale.tsx",
          "operation": "modify",
          "description": "Add a premium check using usePremiumStatus hook before allowing color tag selection in the AddSale form. When a free user taps the color tag picker, open the PremiumModal instead of allowing selection. Premium users can use the color picker without restriction. Keep the color breakdown display on the Home screen visible to all users."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Lock 'Task List' and 'Product List' navigation behind premium with PremiumModal prompts for free users",
      "acceptanceCriteria": [
        "Free users tapping 'Task List' or 'Product List' see the PremiumModal instead of the content",
        "Premium users can access both Task List and Product List without restriction",
        "The lock is enforced both in the bottom navigation and any other entry points to these pages",
        "A premium lock icon or visual indicator is shown on these options for free users"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add premium checks using usePremiumStatus hook to the bottom navigation entries for 'Task List' (Lists page) and 'Product List'. When a free user taps these nav items, prevent navigation and show the PremiumModal. Add a lock icon overlay on these nav items for free users. Premium users navigate freely."
        },
        {
          "path": "frontend/src/pages/Lists.tsx",
          "operation": "modify",
          "description": "Add a premium gate at the page entry level using usePremiumStatus. If a free user accesses this page directly (e.g., via URL), show the PremiumModal and prevent content display. Premium users see the full task list functionality."
        },
        {
          "path": "frontend/src/pages/ProductList.tsx",
          "operation": "modify",
          "description": "Add a premium gate at the page entry level using usePremiumStatus. If a free user accesses this page directly (e.g., via URL), show the PremiumModal and prevent content display. Premium users see the full product list functionality. Note: This page already has a 10-item free limit; this change replaces that with a full premium lock."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Lock 3 specific color themes in Settings behind premium with lock icons and PremiumModal for free users",
      "acceptanceCriteria": [
        "Exactly 3 color themes in Settings are marked as premium-only with a lock icon",
        "Free users tapping a locked theme see the PremiumModal",
        "Premium users can apply all themes including the 3 locked ones",
        "The default/base theme remains accessible to free users without restriction"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Identify 3 color theme options to mark as premium-only (e.g., purple, orange, teal or other visually distinct themes). Add a lock icon to those 3 theme options for free users using usePremiumStatus. When a free user taps a locked theme, open the PremiumModal instead of applying the theme. Premium users can apply all themes. Ensure the default theme remains unlocked and usable by free users."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Enforce a 199-item free tier limit per content type; block 200th add attempt and show PremiumModal",
      "acceptanceCriteria": [
        "Free users can add up to 199 items per content type (sales, products, tasks, shopping list)",
        "The 200th add attempt by a free user is blocked and PremiumModal is shown",
        "Premium users can add unlimited items with no cap",
        "A counter or subtle indicator shows remaining free slots when approaching the limit (e.g., at 190+)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AddSale.tsx",
          "operation": "modify",
          "description": "Add a free-tier item count check using usePremiumStatus before allowing a new sale to be added. Read the current sales array from localStorage and check its length. If a free user has 199+ sales, block the add and show PremiumModal. Premium users can add unlimited sales. Optionally show a counter badge when approaching the limit (e.g., at 190+ sales)."
        },
        {
          "path": "frontend/src/pages/ProductList.tsx",
          "operation": "modify",
          "description": "Add a 199-item free-tier limit check using usePremiumStatus before allowing a new product to be added. If a free user has 199+ products in localStorage, block the add and show PremiumModal. Premium users can add unlimited products. Optionally show a counter when approaching the limit. Note: This replaces the existing 10-item limit with the new 199-item limit."
        },
        {
          "path": "frontend/src/components/TaskListPopup.tsx",
          "operation": "modify",
          "description": "Add a 199-item free-tier limit check using usePremiumStatus before allowing a new task to be added. Read the current tasks array from localStorage and check its length. If a free user has 199+ tasks, block the add and show PremiumModal. Premium users can add unlimited tasks. Optionally show a counter when approaching the limit."
        },
        {
          "path": "frontend/src/components/ShoppingListPopup.tsx",
          "operation": "modify",
          "description": "Add a 199-item free-tier limit check using usePremiumStatus before allowing a new shopping list item to be added. Read the current shopping list array from localStorage and check its length. If a free user has 199+ items, block the add and show PremiumModal. Premium users can add unlimited items. Optionally show a counter when approaching the limit."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Lock custom sound upload feature in Settings behind premium with a lock icon and PremiumModal",
      "acceptanceCriteria": [
        "Custom sound upload option in Settings is visible but locked for free users",
        "A lock icon is displayed next to the custom sound upload option for free users",
        "Tapping the locked custom sound option opens the PremiumModal",
        "Premium users can upload custom sounds without any restriction"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Add a premium check using usePremiumStatus to the custom sound upload section. Display a lock icon next to the custom sound upload option for free users. When a free user taps the locked option, open the PremiumModal instead of allowing the file input to open. Premium users can upload and use custom sounds freely."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Add a premium 'Data Export' feature allowing CSV download of sales/product data; lock for free users",
      "acceptanceCriteria": [
        "A 'Data Export' option is visible in Settings or History page",
        "Free users see a lock icon on the Data Export option and tapping it opens PremiumModal",
        "Premium users can tap Data Export to download their sales/product data as CSV",
        "Exported file includes date, product name, quantity, price, and profit columns"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "modify",
          "description": "Add a 'Data Export' button in the Settings page premium features section. Use usePremiumStatus to check premium status. Free users see a lock icon and tapping opens PremiumModal. Premium users can tap to trigger a CSV export function that reads sales and product data from localStorage, formats it as CSV (with columns: date, product name, quantity, price, profit), and downloads it using a blob URL and anchor element click."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add a premium 'Advanced Statistics' feature showing detailed analytics; lock with overlay for free users",
      "acceptanceCriteria": [
        "An 'Advanced Statistics' section is visible on the Home or History page",
        "Free users see the section with a premium lock overlay; tapping it opens PremiumModal",
        "Premium users see weekly/monthly profit trends, top-selling products, and best sales days",
        "Statistics are calculated from existing localStorage sales data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add an 'Advanced Statistics' section to the Home page below the existing stats summary. Use usePremiumStatus to check premium status. For free users, display a blurred or overlay-locked preview of the statistics section; tapping it opens PremiumModal. For premium users, calculate and display weekly/monthly profit trends, top-selling products, and best sales days using sales data from localStorage. Use simple bar or line indicators for trends."
        }
      ]
    }
  ]
}